RAKWireless/RAK-nRF52-RUI/boards.txt
# SoftDevice Menu
WisCoreRAK4631Board.menu.softdevice.s140v6=0.3.2 SoftDevice s140 7.2.0
WisCoreRAK4631Board.menu.softdevice.s140v6.build.sd_name=s140
WisCoreRAK4631Board.menu.softdevice.s140v6.build.sd_version=7.2.0
WisCoreRAK4631Board.menu.softdevice.s140v6.build.sd_fwid=0x0100

# Debug Menu
WisCoreRAK4631Board.menu.debug.l0=Level 0 (Release)
WisCoreRAK4631Board.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisCoreRAK4631Board.menu.debug.l1=Level 1 (Error Message)
WisCoreRAK4631Board.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisCoreRAK4631Board.menu.debug.l2=Level 2 (Full Debug)
WisCoreRAK4631Board.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisCoreRAK4631Board.menu.debug.l3=Level 3 (Segger SystemView)
WisCoreRAK4631Board.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisCoreRAK4631Board.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Support NFC Menu
WisCoreRAK4631Board.menu.supportnfc.1= Disable
WisCoreRAK4631Board.menu.supportnfc.1.build.nfc_flag=-DCONFIG_NFCT_PINS_AS_GPIOS
WisCoreRAK4631Board.menu.supportnfc.2= Enable
WisCoreRAK4631Board.menu.supportnfc.2.build.nfc_flag=-DSUPPORT_NFC -UCONFIG_NFCT_PINS_AS_GPIOS

WisCoreRAK4631Board.menu.supportat.1=On
WisCoreRAK4631Board.menu.supportat.1.build.support_at_flag=-DSUPPORT_AT
WisCoreRAK4631Board.menu.supportat.2=Off
WisCoreRAK4631Board.menu.supportat.2.build.support_at_flag=-USUPPORT_AT


# ----------------------------------
# WisTrio Cellular RAK5010 Board
# ----------------------------------
WisTrioRAK5010Board.name=WisTrio Cellular RAK5010 Board
WisTrioRAK5010Board.bootloader.tool=bootburn
WisTrioRAK5010Board.build.variant_h=variant_{build.board}.h
WisTrioRAK5010Board.build.series=rak5010

# Upload
WisTrioRAK5010Board.upload.tool=uploader
WisTrioRAK5010Board.upload.protocol=uploader
WisTrioRAK5010Board.upload.use_1200bps_touch=true
WisTrioRAK5010Board.upload.wait_for_upload_port=true
WisTrioRAK5010Board.upload.maximum_size=557056
WisTrioRAK5010Board.upload.maximum_data_size=206448

# Build
WisTrioRAK5010Board.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
WisTrioRAK5010Board.build.f_cpu=64000000
WisTrioRAK5010Board.build.board=WisTrio_RAK5010_Board
WisTrioRAK5010Board.build.core=nRF5
WisTrioRAK5010Board.build.variant=WisTrio_RAK5010_Board
WisTrioRAK5010Board.build.usb_manufacturer="RAKwireless"
WisTrioRAK5010Board.build.usb_product="WisTrio RAK5010 Board"
WisTrioRAK5010Board.build.extra_flags=-DNRF52840_XXAA -DRAK5010_EVB -Drak5010{build.flags.usb}
WisTrioRAK5010Board.build.flags.feature= -DLORA_RF_LP -DLORA_IO_SPI_PORT=2 -DSYS_RTC_COUNTER_PORT=2 -DATCMD_CUST_TABLE_SIZE=64 -DWAN_TYPE=1   -DAUTO_DISPLAY_CELLULAR_RESPONSE  -DBG96_TEST -DBATTERY_LEVEL_SUPPORT -DBLE_CENTRAL_SUPPORT -DAPP_TIMER_V2 -DAPP_TIMER_V2_RTC1_ENABLED -DBOARD_PCA10056 -DS140 -DCONFIG_GPIO_AS_PINRESET -DFLOAT_ABI_HARD -DNRF52840_XXAA -DNRF_SD_BLE_API_VERSION=6 -DUSER_UART -DUSBD_CDC -DBLE_SUPPORT -DDFU_SUPPORT -DBL_SETTINGS_ACCESS_ONLY -DNRF_DFU_SVCI_ENABLED -DNRF_DFU_TRANSPORT_BLE=1 -DSOFTDEVICE_PRESENT -DSWI_DISABLE0 -D__HEAP_SIZE=7168 -D__STACK_SIZE=7168 -DSUPPORT_USB -DSUPPORT_BLE -DCONFIG_NFCT_PINS_AS_GPIOS -DSUPPORT_AT -DRUI_SDK
WisTrioRAK5010Board.build.flags.lib_path="-L{runtime.platform.path}/cores/nRF5/app" "-L{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840" "-L{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840/uhal" "-L{runtime.platform.path}/cores/nRF5/external" "-L{runtime.platform.path}/cores/nRF5/component/core/board/{build.series}" "-L{runtime.platform.path}/cores/nRF5/component/udrv/serial" "-L{runtime.platform.path}/cores/nRF5/component/udrv/flash" "-L{runtime.platform.path}/cores/nRF5/component/udrv/timer" "-L{runtime.platform.path}/cores/nRF5/component/service/nvm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/system" "-L{runtime.platform.path}/cores/nRF5/component/udrv/powersave" "-L{runtime.platform.path}/cores/nRF5/component/udrv/wdt" "-L{runtime.platform.path}/cores/nRF5/component/udrv/gpio" "-L{runtime.platform.path}/cores/nRF5/component/udrv/twimst" "-L{runtime.platform.path}/cores/nRF5/component/udrv/delay" "-L{runtime.platform.path}/cores/nRF5/component/udrv/rtc" "-L{runtime.platform.path}/cores/nRF5/component/udrv/delay" "-L{runtime.platform.path}/cores/nRF5/component/udrv/gpio" "-L{runtime.platform.path}/cores/nRF5/component/udrv/rtc" "-L{runtime.platform.path}/cores/nRF5/component/udrv/twimst" "-L{runtime.platform.path}/cores/nRF5/component/udrv/dfu" "-L{runtime.platform.path}/cores/nRF5/component/udrv/pwm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/adc" "-L{runtime.platform.path}/cores/nRF5/component/udrv/pdm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/ble" "-L{runtime.platform.path}/cores/nRF5/component/service/battery" "-L{runtime.platform.path}/cores/nRF5/component/service/mode" "-L{runtime.platform.path}/cores/nRF5/component/service/debug" "-L{runtime.platform.path}/cores/nRF5/component/rui_v3_api" "-L{runtime.platform.path}/cores/nRF5/component/fund/event_queue" "-L{runtime.platform.path}/cores/nRF5/component/fund/circular_queue" "-L{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/nrf_cc310/lib/cortex-m4/hard-float" "-L{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/nrf_oberon/lib/cortex-m4/hard-float" "-L{runtime.platform.path}/variants/{build.variant}" "-L{runtime.platform.path}/system/{build.variant}"
